{
  "EP3147157A1": "A vehicle headlamp system that irradiates a marking beam onto a pedestrian that exists in front of the vehicle comprising a pedestrian detecting unit that detects a position of the pedestrian that exists in front of the vehicle and a distance between the vehicle and the pedestrian a marking beam setting unit that sets a beam irradiation position of the marking beam in correspondence with the position of the pedestrian detected by the pedestrian detecting unit and variably sets a beam width of the marking beam in accordance with the distance a light distribution control unit that generates a control signal for forming the marking beam in accordance with the beam irradiation position and the beam width set by the marking beam setting unit and a lamp unit that forms the marking beam in accordance with the control signal generated by the light distribution control unit wherein the marking beam setting unit sets the beam width so that the beam width increases as the distance decreases.",
  "cited_document_id": {
    "EP2381162": "The light distribution patterns shown in FIGS.6B 7C and 7D are intermediate light distribution patterns between the high beam distribution pattern PH and the low beam distribution pattern PL. Here the light distribution pattern PB shifts a localized light distribution pattern PBO indicated by a twodot chain line in the drawing that cuts out a section of the additional light distribution pattern PA indicated by a twodot chain line in the drawing positioned near HV in a substantially vertically oblong shape. In the control unit 50 when the presence of a pedestrian 2 is detected ahead of the vehicle by processing image data of a view ahead of the vehicle taken by the onboard camera 52 a leftright angle of deflection from the vehicle front direction to the location of the pedestrian 2 is calculated and the lamp unit 20 is turned by driving the swivel mechanism 40 based on the calculation result. The light distribution pattern PB is formed into a localized substantially vertically oblong shape because when the movable shade 28 is at the first light shielding position only light among reflected light from the pair of left and right reflectors 26 that passes through the slitlike space S formed between the pair of left and right projection portions 28a of the main body portion 28A is incident to the projection lens 22. An intermediate light distribution pattern PM1 shown in FIG.6B is a synthesized light distribution pattern that is formed by adding the light distribution pattern PB which is a portion of the additional light distribution pattern PA to the low beam distribution pattern PL. Accordingly the pedestrian 2 is illuminated by the irradiated light forming the light distribution pattern PB.Since the light distribution pattern PB is formed into a localized substantially vertically oblong shape the driver of the host vehicle can be easily alerted to the direction in which the pedestrian 2 is located and the risk of unintentionally directing glare at a driver of an oncoming vehicle or other people can be kept to a minimum.In addition the light distribution pattern PB with a localized substantially vertically oblong shape has a lower end portion that is formed so as to extend bandlike on the road ahead of the vehicle in the direction of the angle ofdeflection in which the pedestrian 2 is located.Therefore the driver of the host vehicle can be more easily alerted to the location of the pedestrian 2. In order to ensure that the pedestrian 2 is appropriately illuminated by the light distribution pattern PB the leftright width of the light distribution pattern PB is preferably set to a value within an angular range of 1 to 3 degrees e.g.approximately 2 degrees.The leftright width of the light distribution pattern PB can be easily set based on the leftright width of the space S. The light distribution pattern PB is formed when the pair of left and right light sources 24a are lit while the lamp unit 20 is turned rightward from the normal state by driving of the swivel mechanism 40 and the movable shade 28 is rotated to the first light shielding position by the actuator 30.",
    "EP2381162-2":"The light distribution patterns shown in FIGS.6B 7C and 7D are intermediate light distribution patterns between the high beam distribution pattern PH and the low beam distribution pattern PL. The light distribution pattern PB is formed when the pair of left and right light sources 24a are lit while the lamp unit 20 is turned rightward from the normal state by driving of the swivel mechanism 40 and the movable shade 28 is rotated to the first light shielding position by the actuator 30. Here the light distribution pattern PB shifts a localized light distribution pattern PBO indicated by a twodot chain line in the drawing that cuts out a section of the additional light distribution pattern PA indicated by a twodot chain line in the drawing positioned near HV in a substantially vertically oblong shape. In order to ensure that the pedestrian 2 is appropriately illuminated by the light distribution pattern PB the leftright width of the light distribution pattern PB is preferably set to a value within an angular range of 1 to 3 degrees e.g.approximately 2 degrees.The leftright width of the light distribution pattern PB can be easily set based on the leftright width of the space S. Accordingly the pedestrian 2 is illuminated by the irradiated light forming the light distribution pattern PB.Since the light distribution pattern PB is formed into a localized substantially vertically oblong shape the driver of the host vehicle can be easily alerted to the direction in which the pedestrian 2 is located and the risk of unintentionally directing glare at a driver of an oncoming vehicle or other people can be kept to a minimum.In addition the light distribution pattern PB with a localized substantially vertically oblong shape has a lower end portion that is formed so as to extend bandlike on the road ahead of the vehicle in the direction of the angle ofdeflection in which the pedestrian 2 is located.Therefore the driver of the host vehicle can be more easily alerted to the location of the pedestrian 2. The light distribution pattern PB is formed into a localized substantially vertically oblong shape because when the movable shade 28 is at the first light shielding position only light among reflected light from the pair of left and right reflectors 26 that passes through the slitlike space S formed between the pair of left and right projection portions 28a of the main body portion 28A is incident to the projection lens 22. An intermediate light distribution pattern PM1 shown in FIG.6B is a synthesized light distribution pattern that is formed by adding the light distribution pattern PB which is a portion of the additional light distribution pattern PA to the low beam distribution pattern PL. In the control unit 50 when the presence of a pedestrian 2 is detected ahead of the vehicle by processing image data of a view ahead of the vehicle taken by the onboard camera 52 a leftright angle of deflection from the vehicle front direction to the location of the pedestrian 2 is calculated and the lamp unit 20 is turned by driving the swivel mechanism 40 based on the calculation result.",
    "EP2631122":"That is the integrated controller 14 is configured to use the right marking light unit 30BR when a distance between the vehicle 10 and a detected person is equal to or less than a first predetermined value and to use the left marking light unit 30BL when the distance between the vehicle 10 and the detected person exceeds the first predetermined value. Also the first driving mechanism may pivot the lens in the right and left direction to move the illumination region in the right and left direction.In this case as compared to the configuration in which the whole lamp unit is swiveled in the right and left direction an object to be controlled is light in weight.Therefore it is possible to quickly follow the movement of a detected object and miniaturize and simplify the driving mechanism. The invention provides a technology that reliably lets a detected pedestrian or the like recognize existence of a vehicle without causing glare by spotlight illumination to the pedestrian or the like. The reasons why the spotlight illumination is performed are that the spotlight illumination enables a driver to surely visually recognize a pedestrian or the like who exists ahead of the vehicle when the vehicle runs at night or the like and that danger can be avoided by letting the detected pedestrian or the like recognize the existence of the vehicle.However strong glare is caused to the pedestrian to whom light is emitted in the spotlight manner. A headlamp control system includes a lamp unit a first driving mechanism a camera a detection section and a control section.The lamp unit includes a light source and a lens.The light source has at least one light emitting element.The lens is configured to form an illumination region ahead of a vehicle by allowing light emitted from the light source to pass therethrough.The first driving mechanism is configured to move the illumination region in a right and left direction.The camera is configured to capture ahead of the vehicle.The detection section is configured to detect a person existing ahead of the vehicle based on an image captured by the camera.The control section is configured to control the first driving mechanism so that the illumination region includes the person detected by the detection section and to form a nonillumination region in the illumination region so that at least a head of the person is included in the nonillumination region. The luminous intensity of the illumination light reaching the person being at a sufficiently distant position is decreased and the glare caused to the person would be small.Therefore the priority is put on the visibility and the spotlight illumination is performed without the light being blocked by the shade 71.That is when the distance between the vehicle 10 and the detected person exceeds a second predetermined value which is larger than the first predetermined value the integrated controller 14 controls the motor 72 to move the shade 71 to the open position. Also the light source may include a plurality of light emitting elements arranged in an upper and lower direction.The control section may turn off at least one of the plurality of light emitting elements in accordance with a position of the head of the person to form the nonillumination region. With the configuration in the case where the nonillumination regions are formed by moving the shades or turning off the predetermined light emitting elements that is a range of the nonillumination regions is not changed two types of heights are achieved for the lower ends of the nonillumination regions which can be selectively used depending upon a situation. Fig.8 illustrates the state in which plural persons P1 to P3 exist ahead of the vehicle 10.The person P2 is further from the vehicle 10 than the person P1.Also the person P3 is further from the vehicle 10 than the person P2.The person P1 is illuminated with theillumination light SR with the light being blocked by the shade 71 of the right marking light unit 30BR.The person P2 is illuminated with the illumination light SL with the light being blocked by the shade 71 of the left marking light unit 30BL.The person P3 is illuminated with the illumination light SL without the light being blocked by the shade 71 of the left marking light unit 30BL. An region Af in the illumination region Ae indicates a region which will be a nonillumination region when the shade 71 located at the block position blocks a part of the light emitted from the light emitting element 51e.A height of a lower end Ag of the nonillumination region Af is set so that at least the head Ph of the person P who is detected at a distance from the vehicle 10 being lower than a predetermined value is included in the nonillumination region Af.The predetermined value may be defined appropriately as a distance which is required to call attention to the driver of the vehicle 10. Also there may be provided the at least two lamp units.The at least two lamp units may be respectively disposed in left and right front portions of the vehicle.The lamp unitdisposed in the left front portions of the vehicle and the lamp unit disposed in the right front portion of the vehicle may be different in height of a lower end of the nonillumination region. The reflector 52 is provided in front of the light emitting elements 51a to 51d it is noted that the reflector 52 is not illustrated in Fig.2 so that the light source 51 is easily recognized.The light emitted from the light emitting elements 51a to 51d is reflected by the reflector 52 and then is guided to the projection lens 41.A light distribution angle in the left and right directions of illumination light obtained through the projection lens 41 is in a range of 1 degree to 3 degrees. Fig.2 is a perspective view illustrating an appearance of the marking light unit 30.The marking light unit 30 includes a lens unit 40 a light source unit 50 and an actuator unit 60. The marking light unit 30 is a lamp unit that when the integrated controller 14 detects a pedestrian or the like ahead of the vehicle 10 based on the image captured by the camera 18 emits light to the pedestrian or the like in a spotlight fashion.In this embodiment the marking light unit 30 is mounted in the vehicle 10 as an independent lamp unit from a lowbeam illumination lamp unit and a highbeam illumination lamp unit for illuminating ahead of the vehicle 10. Specifically if the person detected near the vehicle is illuminated by the lamp unit which is set so that the lower end of the nonillumination region is at a higher position an area of the illumination region on the person can be increased thereby enabling the driver to have the good visibility.If the person detected at a distant position is illuminated by the lamp unit which is set so that the lower end of the nonillumination region is at a lower position the reliable glare suppression effect can be achieved. The configuration in which the nonillumination region Af is formed by whether the shade 71 is at the open position or the block position cannot change the lower end Ag of the nonillumination region Af.Therefore as the distance between the person P and the vehicle 10 becomes smaller the position of the lower end Ag comes closer to the feet.In this instance a ratio of the illumination region on the person P becomes small.As a result visibility achieved by the spotlight illumination might be deteriorated. The person P1 is illuminated by the right marking light unit 30R which is set so that the lower end AgR of the nonillumination region Af is at a higher position.Therefore an area of the illumination region on the person P1 can be increased thereby allowing the driver to have the good visibility.The person P2 is illuminated by the left marking light unit 30L which is set so that the lower end AgL of the nonillumination region Af is at a lower position.Therefore the glare suppression effect can be achieved. Also the control section may form the nonillumination region using any one of the lamp units disposed in the left and right front portions of the vehicle in accordance with a distance between the vehicle and the person detected by the detection section."
  }
}