{
  "EP2757616A1": "A positive electrode for a rechargeable lithium battery including a current collector a positive active material layer disposed on the current collector wherein the positive active material layer comprises a positive active material active carbon and an additive wherein said positive active material comprises a lithium metal oxide and wherein said additive comprises preferably consists in manganese oxide cobalt oxide iron oxide vanadium oxide or a combination thereof preferably manganese oxide cobalt oxide vanadium oxide iron oxide or a combination thereof more preferably Mn3O4 Co3O4 V2O5 Fe3O4 or a combination thereof.",
    "cited_document_id": {
      "EP1391950": "The positive electrode employs a positive active material according to the invention as a major component.It is preferably produced by kneading the positive active material according to the invention together with a conductive material and a binder and optionally with a filler to obtain a positive composite subsequently applying or pressbonding this positive composite to a foillath plate or the like serving as a current corrector and heattreating the resultant structure at a temperature of about from 50C to 250C for about 2 hours.The content of the positive active material is regulated to usually from 80 by weight to 99 by weight preferably from 85 by weight to 97 by weight based on the positive electrode. The positive active materials may further contain other compounds.Examples of such other compounds include Group I compounds such as CuO Cu2O Ag2O CuS and CuSO4 Group IV compounds such as TiS2 SiO2 and SnO Group V compounds such as V2O5 V6O12 VOx Nb2O5 Bi2O3 and Sb2O3 Group VI compounds such as CrO3 Cr2O3 MoO3 MoS2 WO3 and SeO2 Group VII compounds such as MnO2 and Mn2O3 and Group VIII compounds such as Fe2O3 FeO Fe3O4 Ni2O3 NiO CoO3 and CoO compounds such as lithiumcobalt composite oxides and lithiummanganese composite oxides compounds other than the lithiumcobalt oxides described above and the lithiummanganese compounds represented by Li1sMn2stM tO4 conductive polymeric compounds such as disulfides polypyrrole polyaniline polypphenylene polyacetylene and polyacene materials and carbonaceousmaterials of the pseudographite structure.However the optionally usable compounds should not be construed as being limited to these examples. The conductive material is not limited as long as it is an electronconductive material not adversely influencing battery performance.Usually howeverconductive materials such as natural graphite e.g.flake graphite flaky graphite or soillike graphite artificial graphite carbon black acetylene black Ketjen Black carbon whiskers carbon fibers metal e.g.copper nickel aluminum silver or gold powders metal fibers and conductive ceramic materials can be incorporated alone or as a mixture thereof. The negative electrode comprises a negativeelectrode material as a major component.As the negativeelectrode material may be selected any material capable of dopingundoping lithium ions.Examples thereof include lithium metal lithium alloys lithium metalcontaining alloys such as lithiumaluminum lithiumlead lithiumtin lithiumaluminumtin lithiumgallium and Woods metal lithium composite oxides lithiumtitanium and silicon nitride and further include alloys capable of dopingundoping lithium and carbonaceous materials e.g.graphites hard carbon lowtemperaturecalcined carbon and amorphous carbon.Preferred of these for use as a negativeelectrode material are graphites because graphites have an operating potential very close to that of metallic lithium and are hence effective in diminishing selfdischarge and reducing the irreversible capacity in chargedischarge in the case of employing a lithium salt as an electrolyte salt.For example artificial graphite and natural graphite are preferred.In particular a graphitenegative active material whose surface has been modified with e.g.amorphous carbon is desirable because gas generation therefrom during charge is little. The positive active material according to the second embodiment of the invention comprises a composite oxide represented by the composite formula LiwMnxNiyCozO2wherein x y and z are values within such a range that in a ternary phase diagram x y z is present on the perimeter of or inside the quadrilateral ABCD defined by point A 0.51 0.49 0 point B 0.45 0.55 0 point C 0.25 0.35 0.4 and point D 0.31 0.29 0.4 as vertexes and 0wxyz1.30.Due to this constitution a battery having a high energy density and excellent chargedischarge cycle performance can be produced.When zgt0 i.e.when the composite oxide contains cobalt a battery highly excellent in highrate discharge performance and chargedischarge cycle performance can be produced. As the binder can usually be used one of or a mixture of two or more of thermoplastic resins such as polytetrafluoroethylene PTFE polyvinylidene fluoride PVdF polyethylene and polypropylene and polymers havingrubber elasticity such as ethylenepropylenediene terpolymers EPDM sulfonated EPDM styrenebutadiene rubbers SBR and fluororubbers.The amount of the binder to be added is preferably from 1 to 50 by weight especially preferably from 2 to 30 by weight based on the total weight of the positive electrode or negative electrode. Results of analysis of preferred graphites by Xray diffractometry and another technique are shown below.Lattice spacing d002 0.3330.350 nm Crystallite size in aaxis direction La 20 nm or larger Crystallite size in caxis direction Lc 20 nm or larger True density 2.002.25 gcm3 A preferred conductive material of these is acetylene black from the standpoints of electronconductive properties and applicability.The amount of the conductive material to be added is preferably from 0.1 by weight to 50 by weight especially preferably from 0.5 by weight to 30 by weight based on the total weight of the positive electrode or negative electrode.It is especially desirable to use acetylene black which has been pulverized to ultrafine particles of from 0.1 to 0.5 m because use thereof is effective in reducing the amount of carbon required.For mixing those ingredients physical mixing is conducted.Homogeneous mixing is ideal.For this mixing a powder mixer such as a Vtype mixer Stype mixer mortar mill ball mill or planetary mill can be used in a dry or wet mixing process. In the case where a combination of the specific composite oxide according to the invention and one or more other compounds is used as a positive active material the proportion of these optional compounds is not particularly limited as long as the incorporation thereof does not impair the effects of the invention.However the proportion of such optional compounds is preferably from 1 by weight to 50 by weight more preferably from 5 by weight to 30 by weight based on the total weight of the positive active material.",
      "EP2492996": "Examples of the conduction assistant conductive particles for example employed in the positive electrode composite material include conductive carbon such as Ketjen black a metal such as copper iron silver nickel palladium gold platinum indium and tungsten and a conductive metal oxide such as indium oxide and tin oxide.A blending amount of the conduction assistant is preferably between 0.1and 30by weight of the positive electrode active material described above. When the vanadium oxide is contained in an amount of at least 5by weight a favorable effect is achieved on shortcircuits caused by nail penetrating.The vanadium oxide is further more preferably contained in an amount of 10to 95by weight.When the vanadium oxide is contained in an amount of at least 10by weight a favorable effect is achieved on both shortcircuits caused by nail penetrating and shortcircuits caused by overcharging. The D50 of Fe2O3 is preferably between 0.1 m and 25 m more preferably between 1 m and 10 m and further more preferably between 3 m and 7 m. Further examples of the lithiumintercalated carbon materials include carbonbased materials such as graphite and a nongraphitizable carbon material and a polyacene material.The polyacene material is insoluble and infusible PAS having a polyacenebased skeleton or the like for example. The D50 of V3O8 is preferably between 0.1 m and 25 m more preferably between 1 m and 10 m and further more preferably between 3 m and 7 m. A surface of the positive electrode collector that contacts the positive electrode composite material layer is formed from a conductive substrate exhibiting conductivity for example a conductive substrate formed from a conductive material such as a metal a conductive metal oxide and conductive carbon or a nonconductive substrate main body covered with one of these conductive materials. The electric storage device according to the present invention employs a positive electrode active material containing1 lithium nickel cobalt manganese oxide and at least one type of a lithium ion acceptance capacity adjustment compound selected from 2a lithium vanadium composite oxide vanadium oxide lithium vanadium phosphate and lithium vanadium fluorophosphate and 2b Nb2O5 TiO2 Li34Ti53O4 WO2 MoO2 and Fe2O3. A positive electrode composite material having the following composition was obtained.Positive electrode active material the aforementioned mixed material 100 partsBinder polyvinylidene fluoride PVdF 5 partsConduction assistant conductive carbon black 5 partsSolvent Nmethyl 2pyrrolidinone NMP 100 parts Furthermore in the present invention the vanadium oxide is vanadium oxide not containing lithium and in particular is preferably a compoundrepresented by V2O5 or V3O8.Similarly the vanadium oxide is preferably contained in an amount of 5to 95by weight based on the total weight of the positive electrode active material. Fe2O3 may be intermixed in a proportion of more than 20by weight.However when the mixing amount increases the capacity of the positive electrode active material decreases.Therefore Fe2O3 should be mixed in an appropriate amount with safety being taken into account. Examples of the binder employed in the positive electrode composite material include a fluorinecontaining resin such as polyvinylidene fluoride an acrylic binder a rubberbased binder such as SBR a thermoplastic resin such as polypropylene and polyethylene and carboxymethyl cellulose. The positive electrode materials including the positive electrode active material according to the present invention a binder and if necessary a conduction assistant and the like are dispersed in a solvent to form a positive electrode composite material. More preferably Fe2O3 is contained in an amount of at least 10by weight.When Fe2O3 is contained in an amount of at least 10by weight a favorable effect is achieved on both shortcircuits caused by nail penetrating and shortcircuits caused by overcharging. Fe2O3 is preferably contained in an amount of at least 5by weight based on the total weight of the positive electrode active material.When Fe2O3 is contained in an amount of at least 5by weight a favorable effect is achieved on shortcircuits caused by nail penetrating.",
      "EP2418719": "The negative active material may be natural graphite siliconcarbon composite SiOx silicon metal a silicon thin film lithium metal lithium alloy a carbonaceous material or graphite.An example of the lithium alloy may be lithium titanate.The lithium titanate can be categorized into a spineltype lithium titanate an anatasetype lithium titanate and a ramsdellitetype lithium titanate according to a crystal structure.For example the negative active material may be represented by Li4xTi5O12 0x3.For example the negative active material may be Li4Ti5O12 but is not limited thereto. A positive active material was prepared by mixing 1 part by weight of the MoO2 transition metal oxide prepared according to Synthesis Example 1 with 100 parts by weight of LiCoO2.94 wt.weightof the prepared positive active material was mixed with 3 wt.of Super P carbon black and 3 wt.of PVDF to prepare a positive active material slurry composition and then the slurry composition was coated on a current collector formed of an aluminium foil and dried to manufacture a positive electrode.Separately about 3 wt.of graphite powder 3 wt.of polyvinylidenefluoride PVdF as a binder and Nmethyl2pyrrolidone were mixed to prepare a negative active material slurry and the prepared negative active material slurry was coated on a copper foil as a current collector to manufacture a negative electrode.A separator formed of polypropylene was interposed between the positive electrode and the negative electrode and a nonaqueous electrolyte prepared by dissolving 1.50 molL of LiPF6 in a mixed solvent including ethylenecarbonateand diethylcarbonate in a ratio of 37 was injected into the resultant structure thereby completing manufacturing of a coinshaped lithium battery. 1 part by weight of MoO2 was dissolved in 100 ml of water to prepare a coating solution.100 parts by weight of LiCoO2 positive active material having an average particle diameter of 20 m and 1 part by weight of an acetic acid were added to the coating solution so that LiCoO2 positive active material particles were coated with MoO2.The coated LiCoO2 was dried at room temperature for 24 hours and heat treated at a temperature of 400 C for 10 hours to prepare a positive active material.Then the same process as in Example 2 was performed to complete manufacturing a lithium battery.",
      "EP2429020": "90 wt of positive active material of LiMn2O4 5 wt of binder of polyvinylidene fluoride 3 wt of conductive material of carbon black superP and 2 wt of activated carbon of Cmi in which micropores are developed are mixed in a solvent of Nmethylpyrrolidone NMP to provide a positive active material slurry.",
      "EP1903627": "According to another embodiment of the present invention a lithium battery employs a cathode of the present invention.As shown in FIG.4 the lithium battery 3 includes an electrode assembly 4 including a cathode 5 anode 6 and a separator 7 positioned between the cathode 5 and anode 6.The electrode assembly 4 is housed in a battery case 8 and sealed with a cap plate 11 and sealing gasket 12.An electrolyte is then injected into the battery case to complete the battery.In one embodiment of the present invention a lithium battery can be manufactured as follows. The complex compound 0.6LiLi13Mn23O20.4LiNi0.5Co0.1Mn0.4O2 obtained in Comparative Example 1 vanadium oxide V2O5 powder and a conducting agent Ketjen Black were uniformly mixed in a weight ratio of 83.79.33 to obtain a mixture.Then a PVDF binder solution was added to the mixture to make slurries having weight ratios of the complex compound to the vanadium oxide to the conducting agent to the binder of 83.79.334.The manufacture of electrodes and coin cells and the chargedischarge tests were carried out as in Comparative Example 1.The chargedischarge test results are shown in FIGS.1 through 3.FIG.1 is a graph illustrating the initial chargedischarge characteristics when the content of V2O5 was 10 wt based on the cathode active material.FIG.2 illustrates chargedischarge cycle characteristics and FIG.3 illustrates the retention ratioof discharge capacity at an Xth cycle X is the number of cycles to initial charge capacity. First a cathode active material a conducting agent a binder and a solvent are mixed to prepare a cathode active material composition.The cathode active material composition is coated directly on an aluminum current collector and dried to prepare a cathode plate.Alternatively the cathode active material composition is cast on a separate support to form a film which film is then separated from the support and laminated on an aluminum current collector to prepare a cathode plate."
    }
}