{
  "EP3127712A1": "A pneumatic tire having a tread comprising a rubber composition comprising based on 100 parts by weight of elastomer phr A from 50 to 90 phr of a solution polymerized styrenebutadiene rubber having a glass transition temperature Tg in a range of from 65 C to 55 C B from 50 to 10 phr of a polybutadiene having a cis14 content greater than 95 percent and a Tg in a range of from 80 to 110 C and C from 30 to 80 phr of a combination of an oil and a terpene phenol resin having a Tg greater than 100 C.",
    "cited_document_id": {
      "EP1911797": "In order to reduce the rolling resistance and to improve the treadwear characteristics of tires rubbers having a high rebound have traditionally been utilized in making tire tread rubber compounds.On the other hand in order to increase the wet skid resistance of a tire rubbers which undergo a large energy loss have generally been utilized in the tires tread.In order to balance these two viscoelastically inconsistent properties mixtures of various types of synthetic and natural rubber are normally utilized in tire treads.For instance various mixtures of styrenebutadiene rubber and polybutadiene rubber are commonly used as a rubbery material for automobile tire treads. It is highly desirable for tires to have good wet skid resistance low rolling resistance and good wear characteristics.It has traditionally been very difficult to improve a tires wear characteristics without sacrificing its wet skid resistance and traction characteristics.These properties depend to a great extent on the dynamic viscoelastic properties of the rubbers utilized in making the tire. Further resins are used in the rubber composition and generally present in an amount ranging from 5 to 25 phr with a range of from 10 to 20 phr being preferred.Suitable resins include alphamethyl styrene resins coumarone type resins including coumaroneindene resins and mixtures of coumarone resins naphthenic oils phenol resins and rosins.Other suitable resins include phenolterpene resins such as phenolacetylene resins phenolformaldehyde resins terpenephenol resins polyterpene resins and xyleneformaldehyde resins.Further suitable resins include petroleum hydrocarbon resins such as synthetic polyterpene resins aromatic hydrocarbon resins resins resulting from the polymerization of styrene and alphamethyl styrene aliphatic hydrocarbon resins aliphatic cyclic hydrocarbon resins such as dicyclopentadiene resins aliphatic aromatic petroleum resins hydrogenated hydrocarbon resins hydrocarbon tackified resins aliphatic alicyclic petroleum resins rosin derivatives and terpene resins.In one embodiment the resin is selected from hydrocarbon resins synthesized by cationic polymerization of styrene and alphamethyl styrene and coumaroneindene resins.",
      "EP2433812": "Resins may be used in the rubber composition and are generally present in an amount ranging from 5 to 20 phr with a range of from 10 to 20 phr being preferred.Suitable resins include alphamethyl styrene resins coumarone type resins including coumaroneindene resins and mixtures of coumarone resins naphthenic oils phenol resins and rosins.Other suitable resins include phenolterpene resins such as phenolacetylene resins phenolformaldehyde resins terpenephenol resins polyterpene resins and xyleneformaldehyde resins.Further suitable resins include petroleum hydrocarbon resins such as synthetic polyterpene resins aromatic hydrocarbon resins resins resulting from the polymerization of styrene and alphamethyl styrene aliphatic hydrocarbon resins aliphatic cyclic hydrocarbon resins such as dicyclopentadiene resins aliphatic aromatic petroleum resins hydrogenated hydrocarbon resins hydrocarbon tackified resins aliphatic alicyclic petroleum resins rosin derivatives and terpene resins.In one embodiment the resin is selected from hydrocarbon resins synthesized by cationic polymerization of styrene and alphamethyl styrene and coumaroneindene resins. It is highly desirable for tires to have good wet skid resistance low rolling resistance and good wear characteristics.It has traditionally been very difficult to improve a tires wear characteristics without sacrificing its wet skid resistance and traction characteristics.These properties depend to a great extent on the dynamic viscoelastic properties of the rubbers utilized in making the tire. In order to reduce the rolling resistance and to improve the treadwear characteristics of tires rubbers having a high rebound have traditionally been utilized in making tire tread rubber compounds.On the other hand in order to increase the wet skid resistance of a tire rubbers which undergo a large energy loss have generally been utilized in the tires tread.In order to balance these two viscoelastically inconsistent properties mixtures of various types of synthetic and natural rubber are normally utilized in tire treads.For instance various mixtures of styrenebutadiene rubber and polybutadiene rubber are commonly used as a rubbery material for automobile tire treads.",
      "EP3031620": "Terpenephenol resins may be used.Terpenephenol resins may be derived by copolymerization of phenolic monomers with terpenes such as limonenes and pinenes. It is highly desirable for tires to have good wet skid resistance low rolling resistance and good wear characteristics.It has traditionally been very difficult to improve a tires wear characteristics without sacrificing its wet skid resistance and traction characteristics.These properties depend to a great extent on the dynamic viscoelastic properties of the rubbers utilized in making the tire. In order to reduce the rolling resistance and to improve the treadwear characteristics of tires rubbers having a high rebound have traditionally been utilized in making tire tread rubber compounds.On the other hand in order to increase the wet skid resistance of a tire rubbers which undergo a large energy loss have generally been utilized in the tires tread.In order to balance these two viscoelastically inconsistent properties mixtures of various types of synthetic and natural rubber are normally utilized in tire treads. The rubber composition of the outer cap layer also includes from 5 to 25 phr of processing oil.Processing oil may be included in the rubber composition as extending oiltypically used to extend elastomers.Processing oil may also be included in the rubber composition by addition of the oil directly during rubber compounding.The processing oil used may include both extending oil present in the elastomers and process oil added during compounding.Suitable process oils include various oils as are known in the art including aromatic paraffinic naphthenic and low PCA oils such as MES TDAE and heavy naphthenic oils and vegetable oils such as sunflower soybean and safflower.",
      "EP2412731": "The invention relates to a rubber composition its method of manufacture and to a pneumatic rubber tire with a component comprising a silica reinforced rubber composition comprising a specialized polybutadiene rubber a functionalized styrenebutadiene elastomer and a cis 14polyisoprene rubber. Pneumatic rubber tires are often desired to have treads of a rubber composition which will provide properties which include good traction on the road resistance to tread wear and low rolling resistance.It has traditionally been difficult to improve one of such properties without sacrificing one or more of the other properties.Such properties depend to a great extent upon dynamic viscoelastic properties of elastomers used in making the tread rubber composition as well as viscoelastic properties of the rubber composition itself.",
      "EP1637353": "It is highly desirable for tires to have good wet skid resistance low rolling resistance and good wear characteristics.It has traditionally been very difficult to improve a tires wear characteristics without sacrificing its wet skid resistance and traction characteristics.These properties depend to a great extent on the dynamic viscoelastic properties of the rubbers utilized in making the tire. In order to reduce the rolling resistance and to improve the treadwear characteristics of tires rubbers having a high rebound have traditionally been utilized in making tire tread rubber compounds.On the other hand in order to increase the wet skid resistance of a tire rubbers which undergo a large energy loss have generally been utilized in the tires tread.In order to balance these two viscoelastically inconsistent properties mixtures of various types of synthetic and natural rubber are normally utilized in tire treads.For instance various mixtures of styrenebutadiene rubber and polybutadiene rubber are commonly used as a rubbery material for automobile tire treads.",
      "EP3031621": "In order to reduce the rolling resistance and to improve the treadwear characteristics of tires rubbers having a high rebound have traditionally been utilized in making tire tread rubber compounds.On the other hand in order to increase the wet skid resistance of a tire rubbers which undergo a large energy loss have generally been utilized in the tires tread.In order to balance these two viscoelastically inconsistent properties mixtures of various types of synthetic and natural rubber are normally utilized in tire treads. Terpenephenol resins may be used.Terpenephenol resins may be derived by copolymerization of phenolic monomers with terpenes such as limonenes and pinenes. The rubber composition includes a processing oil.Processing oil may be included in the rubber composition as extending oil typically used to extend elastomers.Processing oil may also be included in the rubber composition by addition of the oil directly during rubber compounding.The processing oil used may include both extending oil present in the elastomers and process oil added during compounding.Suitable process oils include various oils as are known in the art including aromatic paraffinic naphthenic and low PCA oils such as MES TDAE and heavy naphthenic oils and vegetable oils such as sunflower soybean and safflower oils. It is highly desirable for tires to have good wet skid resistance low rolling resistance and good wear characteristics.It has traditionally been very difficult to improve a tires wear characteristics without sacrificing its wet skid resistance and traction characteristics.These properties depend to a great extent on the dynamic viscoelastic properties of the rubbers utilized in making the tire."
    }
}